N, M = map(int, input().split())
arr = [list(map(int, input().split())) for _ in range(N)]

direct = [
    [(1, 0), (2, 0), (3, 0)], [(0, 1), (0, 2), (0, 3)], # 작대기
    [(0, 1), (1, 0), (1, 1)], # 네모
    [(1, 0), (2, 0), (2, 1)], [(0, 1), (0, 2), (-1, 2)], [(0, 1), (1, 1), (2, 1)], [(0, 1), (0, 2), (1, 0)], # 니은 반시계 회전
    [(1, 0), (2, 0), (0, 1)], [(1, 0), (1, 1), (1, 2)], [(0, 1), (-1, 1), (-2, 1)], [(0, 1), (0, 2), (1, 2)], # 니은 대칭 반시계 회전
    [(1, 0), (1, 1), (2, 1)], [(0, 1), (-1, 1), (-1, 2)], # 꾸불
    [(-1, 0), (-1, 1), (-2, 1)], [(0, 1), (1, 1), (1, 2)], # 꾸불 대칭
    [(0, 1), (0, 2), (1, 1)], [(1, 0), (1, 1), (2, 0)], [(0, 1), (0, 2), (-1, 1)], [(0, 1), (1, 1), (-1, 1)] # 방향키 회전
]

def calc(x, y, pos):
    sm = arr[x][y]
    for p in pos:
        nx, ny = x+p[0], y+p[1]
        if 0<=nx<N and 0<=ny<M:
            sm += arr[nx][ny]
        else:
            return 0
    return sm

result = 0
for i in range(N):
    for j in range(M):
        for d in direct:
            result = max(result, calc(i, j, d))

print(result)